{
  "bacon" : "Command for fetching a random video from Bacon_'s youtube channel\nFormat: !bacon [tag (optional]\nIf a tag is added the parser will try to find a random video with that tag. Current supported tags are 'skyrim' and 'oblivion'.",
  "calculate" : "Command for calculating a simple espression\nFormat: !calculate [expression]\nThe bot can calculate simple arithmethic as well as some functions as sqrt(), sin(), cos(), and log().",
  "commander" : "Command for fetching a random legendary card that may be use for the Commander gamemode in the card game Magic: The Gathering\nFormat: !commander\nSome unofficial cards that are not legendary may appear from time to time. These are not officialy allowed as commanders, but may be used if all players agree\nCards that are banned may also appear when using this command",
  "hangman" : "Command for starting a hangman game\nFormat: !hangman [number of guesses (optional)]\nIf no argument is given, the game will use a default value\nWrite a character or word to come with suggestion",
  "help" : "Command that shows a summary of all basic commands\nFormat: !help ['dev' (optional)]\nIf the word 'dev' is added some additional technical commands for development is supplied",
  "gtn" : "Start a \"Guess the Number\" game\nFormat !gtn [highest possible number (optional)]\nFirst player to guess which number the bot is thinking of wins!",
  "nrk" : "Command that fetches hyperlinks to the last top stories published by NRK (Norwegian Broadcasting Corporation)\nFormat: !nrk [tag (optional)] [number of links (optional)]\nThis commands has two optional arguments:\n1. tag: Keyword to search for. Only stories containing this keyword will be shown\n2. Number of links: The maximum number of links that should be posted by the bot. This is set to 1 by default",
  "ping" : "Pings the bot to check if it is active\nFormat: !ping",
  "pokelist" : "Command for getting a list of all pokemon that matches a search\nFormat: !pokelist [type1 (optional)] [type2 (optional)] [generation (optional)]\nThis command has three optional arguments:\n1. Type1: First type for the desired pokemon. If type1 is set but not type2 the script will fetch pokemon of _only_ this type\n2. Type2: Second type for the desired pokemon. If you want all pokemon that contains type1 and don't care about the secondary type this can be set to 'all' or any other non-empty string\n3. Generation: Generation of pokemon to filter on. Format should be 'genX' where X is the generation you want\nExamples:\n'!pokelist grass' fetches all pokemon that are only grass type\n'!pokelist steel rock gen3' fetches all steel-rock pokemon from generation 3",
  "pokemon" : "Command for getting a random pokemon\nFormat: !pokemon [type1 (optional)] [type2 (optional)] [generation (optional)]\nThis command has three optional arguments:\n1. Type1: First type for the desired random pokemon. If type1 is set but not type2 the script will fetch a random pokemon of _only_ this type\n2. Type2: Second type for the desired pokemon. If you want a pokemon that contains type1 but don't care about the secondary type this can be set to 'all' or any other non-empty string\n3. Generation: Generation of pokemon to filter on. Format should be 'genX' where X is the generation you want\nExamples:\n'!pokemon' fetches a random pokemon\n'!pokemon grass' fetches a pokemon that are only grass type\n'!pokemon steel rock gen3' fetches a random steel-rock pokemon from generation 3",
  "roll" : "Command for rolling dice\nFormat: !roll [number of dice]d[type of dice]\nThe number of dice as well of the dice's size must be present for this command to work\nThe bot will not let you roll zero or negatice dice, nor let you roll any dice with zero or negative dice\nThe maximum number and sides of a dice is 2147483646, though the bot will probably generate a too long message if any ridiculously high numbers are used",
  "tofflus" : "Gets a episodic Christmas themed TV-series from NRK\nThis command will return a link to a unique episode each day between 1st and 24th of December",
  "wiki" : "Command for fetching a link to a random wikipedia article\nFormat: !wiki"
}